# RebarElemQuantityOfBars Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarElemQuantityOfBars Property
ParameterTypeId Class See Also
---
"Quantity"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarElemQuantityOfBars { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarElemQuantityOfBars As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarElemQuantityOfBars {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace